[
  {
    "linkURL": "https://github.com/manueme/proygrado",
    "linkText": "To Github!",
    "title": "RTX Turing architecture research",
    "imgSrc": "https://www.manueme.com/images/rtx.jpg",
    "brief": "In late 2018 NVIDIA released the Turing architecture intending to execute ray tracing in real-time (using RT cores) and speeding up the artificial intelligence process (using Tensor cores). Beyond commercial promises, NVIDIA's proposal is auspicious and deserves detailed analysis.<br/><br/>In this project, it is proposed to know more about the possibilities of RT cores for ray tracing development, as well as their real advantages compared to CPU or GPU development of previous generations. It is also proposed to study the Artificial Intelligence techniques developed by NVIDIA, and other research groups, for the improvement, denoising, and acceleration of the generation of images with ray tracing. For this, one or more ray-tracing applications will be carried out, which may have different objectives: physically realistic ray tracing, real-time ray tracing (with AI-based denoising), path tracing and other methodologies suitable for daylighting analysis.<br/><br/>Follow the project progress by visiting the project repository on GitHub",
    "imgAlt": "",
    "date": "2020/06/16",
    "author": "Manuel Machado",
    "keywords": "Ray Tracing, Vulkan, RTX, C++",
    "description": ""
  },
  {
    "linkURL": "https://github.com/manueme/react-redux-boilerplate",
    "linkText": "To Github!",
    "title": "[CODE] - React 16.10 boilerplate with Redux",
    "imgSrc": "https://www.manueme.com/images/boilerLogin.jpg",
    "brief": "This is a project to start a React web application, it contains examples for login and sign up forms with dummy actions. It also has a private route component witch redirects to the login view if the user is not logged in or the local storage authentication data is not valid.",
    "imgAlt": "",
    "date": "2019/10/26",
    "author": "Manuel Machado",
    "keywords": "React",
    "description": ""
  },
  {
    "article": "pixsplat",
    "title": "Pixsplat",
    "imgSrc": "https://www.manueme.com/images/Grid.png",
    "brief": "Pixsplat is a cross-platform drawing and animation program created to make low-resolution graphics. The main goal of the project is to cover the basic needs of an artist to work with pixel art, however, it is also intended to provide some capabilities of more advanced image editors.<br/><br/>Pixsplat is written in C++ with wxWidgets, OpenGL and FreeImage for the UI, rendering the document canvas, and handling images respectively.",
    "imgAlt": "",
    "date": "2019/09/02",
    "author": "Manuel Machado",
    "keywords": "wxWidgets, c++, OpenGL, FreeImage, Pixel-Art",
    "htmlPath": "pixsplat.html",
    "description": "Pixsplat is a cross-platform drawing and animation program created to make low-resolution graphics."
  },
  {
    "article": "blog",
    "title": "Blog Ready",
    "imgSrc": "https://www.manueme.com/images/blog.jpg",
    "brief": "My blog is ready to publish! So let's start with the first article. Here are some details of the implementation.",
    "imgAlt": "",
    "date": "2019/09/01",
    "author": "Manuel Machado",
    "keywords": "Angular",
    "htmlPath": "blog.html",
    "description": "My blog is ready to publish! So let's start with the first article. Here are some details of the implementation."
  }
]
